{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "AWS Backup",
    "1": "AWS Fargate",
    "2": "AWS IAM",
    "3": "AWS KMS",
    "4": "AWS Lambda",
    "5": "AWS Secrets Manager",
    "6": "AWS WAF",
    "7": "Amazon Aurora",
    "8": "Amazon CloudFront",
    "9": "Amazon DynamoDB",
    "10": "Amazon EBS",
    "11": "Amazon EC2",
    "12": "Amazon EFS",
    "13": "Amazon ElastiCache",
    "14": "Amazon RDS",
    "15": "Amazon Route 53",
    "16": "Amazon S3",
    "17": "Amazon VPC",
    "18": "Elastic Beanstalk",
    "19": "Elastic Load Balancing"
  },
  "initializer_range": 0.02,
  "label2id": {
    "AWS Backup": 0,
    "AWS Fargate": 1,
    "AWS IAM": 2,
    "AWS KMS": 3,
    "AWS Lambda": 4,
    "AWS Secrets Manager": 5,
    "AWS WAF": 6,
    "Amazon Aurora": 7,
    "Amazon CloudFront": 8,
    "Amazon DynamoDB": 9,
    "Amazon EBS": 10,
    "Amazon EC2": 11,
    "Amazon EFS": 12,
    "Amazon ElastiCache": 13,
    "Amazon RDS": 14,
    "Amazon Route 53": 15,
    "Amazon S3": 16,
    "Amazon VPC": 17,
    "Elastic Beanstalk": 18,
    "Elastic Load Balancing": 19
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.55.4",
  "vocab_size": 30522
}
